package main

import "fmt"

func main() {
	//for i := -2; i < 4; i++ {
	//Цикл отработал 5 раз.Первоначально он задает для i значение 0, а затем проверяет, является ли значение i меньше 5. Так как значение i меньше 5, цикл выполняется и функция fmt.Println(i) исполняется. После завершения цикла вызывается оператор i++, а значение i увеличивается на 1.

	//for i := 0; i < 15; i += 3 {
	//В данном случае цикл for задан таким образом, чтобы выводить числа с 0 до 15, но с увеличением на 3, так что на экран будет выводиться только каждое 3 число:

	//for i := 100; i > 0; i -= 10 {
	//Здесь мы зададим для i начальное значение 100, воспользуемся условием i < 0 для остановки при 0, а в пост-операторе будем уменьшать значение на 10 с помощью оператора -=. Цикл начинает работу при 100 и заканчивается при 0, а значение уменьшается на 10 при каждой итерации. Вы можете увидеть, как это происходит, в выводе:

	//i := 0
	//for i < 5 {
	//	fmt.Println(i)
	//	i++
	//На этот раз мы объявили переменную i отдельно от цикла for в предшествующей строке кода. Цикл имеет только одно условие, которое проверяет, остается ли i менее 5. Если условие возвращает true, цикл будет продолжаться.

		//fmt.Println(i)
	}
}
